Revit 2024 API
ExternalResourceLoadData.LoadStatus Property
 The success or failure status of the load attempt.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ExternalResourceLoadStatus LoadStatus { get; }
Visual Basic
Public ReadOnly Property LoadStatus As ExternalResourceLoadStatus
	Get
Visual C++
public:
property ExternalResourceLoadStatus LoadStatus {
	ExternalResourceLoadStatus get ();
}
See Also
ExternalResourceLoadData Class
Autodesk.Revit.DB Namespace